In [1]:
import pandas as pd

In [8]:
pd.DataFrame({'name' : ['tarun ,chitu'] , 'add':['moida , mubai'] })

           name            add
0  tarun ,chitu  moida , mubai

In [18]:
pd.DataFrame({'name':['tarun' ,'varun'] ,'add' :['mombai' ,'pune']},index =['a' ,'b'] )

    name     add
a  tarun  mombai
b  varun    pune

In [35]:
df=pd.DataFrame({ 'Animal':['parrot','parrot','dog','dog'],
                 'max_speed':[50,80,76,94],
                'food':['fd','gh','jk','ew']})
df

   Animal  max_speed food
0  parrot         50   fd
1  parrot         80   gh
2     dog         76   jk
3     dog         94   ew

In [36]:
df.groupby('Animal')['max_speed'].sum().sort_values(ascending=False)

Animal
dog       170
parrot    130
Name: max_speed, dtype: int64

In [37]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)
df

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [50]:
df.groupby('Type')['Max Speed'].sum().sort_values(ascending=False).reset_index()

      Type  Max Speed
0  Captive      420.0
1     Wild      370.0

In [44]:
df.groupby(level="Type").sum()

         Max Speed
Type
Captive      420.0
Wild         370.0

In [56]:
l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
df = pd.DataFrame(data=l, columns=["a", "b", "c"],index=[1,2,3,4])
df

      a     b      c
1     a  12.0   12.0
2  None  12.3   33.0
3     b  12.3  123.0
4     a   1.0    1.0

In [54]:
df.groupby('a').sum()

      b      c
a
a  13.0   13.0
b  12.3  123.0

In [60]:
df.groupby(by='a',dropna=False,sort=True).sum()

        b      c
a
a    13.0   13.0
b    12.3  123.0
NaN  12.3   33.0

In [71]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})

df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [75]:
df.groupby("Animal", group_keys=True).apply(lambda x: x)

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0